# Python Pandas

In [3]:
import pandas as pd

In [4]:
import numpy as np

## Panda Series

In [5]:
#creating a panda series
letters='abcdefg'

In [6]:
first_series=pd.Series(list(letters))

In [7]:
first_series

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

In [8]:
#Series from a ndarray
np_country=np.array(['Kenya','Uganda','South Africa','Tanzania','Ghana','Nigeria','Egypt','Algeria'])

In [9]:
Series_country=pd.Series(np_country)

In [10]:
Series_country

0           Kenya
1          Uganda
2    South Africa
3        Tanzania
4           Ghana
5         Nigeria
6           Egypt
7         Algeria
dtype: object

In [11]:
Series_country[0]

'Kenya'

In [12]:
GDP=[234,546,567,890,123,456,567,789]

In [13]:
#series from dict
Series2=pd.Series(GDP,index=[np_country])

In [14]:
Series2

Kenya           234
Uganda          546
South Africa    567
Tanzania        890
Ghana           123
Nigeria         456
Egypt           567
Algeria         789
dtype: int64

In [15]:
#Creating Series from scalar
scalar_series=pd.Series(5.,index=['a','b','d','d','e'])

In [16]:
scalar_series

a    5.0
b    5.0
d    5.0
d    5.0
e    5.0
dtype: float64

pd.Series(data,index)

In [17]:
#accessing
Series_country[0:4]

0           Kenya
1          Uganda
2    South Africa
3        Tanzania
dtype: object

In [18]:
Series2[0:5]

Kenya           234
Uganda          546
South Africa    567
Tanzania        890
Ghana           123
dtype: int64

In [19]:
#accessing values along a row through index name
Series2.loc["Uganda"]

Uganda    546
dtype: int64

In [20]:
#accessing values in a row through their index's index
Series2.iloc[0]

234

looking up through index position.
Basically accessing the rows

#### Vectorized Operations in Series

<p>Vectorized operations show how series can be added. Are performed by the index positions of data elements

In [21]:
Data=[1,2,3,4]
Data2=[10,20,30,40]

In [22]:
first_vector_series=pd.Series(Data,index=['a','b','c','d'])

In [23]:
second_vector_series=pd.Series(Data2,index=['a','b','c','d'])

In [24]:
first_vector_series+second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

<p> The data element is bound to the index position. Shuffling shows these results </p>

In [25]:
second_vector_series=pd.Series(Data2,index=['a','d','b','c'])

In [26]:
first_vector_series+second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

In [27]:
#let's introduce new indices
second_vector_series=pd.Series(Data2,index=['a','b','e','f'])

In [28]:
first_vector_series+second_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

<p>Further shows the data elemet boundness to the index. The new second_vector_series lacks c and d and threfore no additions could be made </p>
The additional letters do not match any index in the first series </br>

## Panda DataFrame

In [29]:
import pandas as pd

In [30]:
#Creating a dataframe from dictionary of equal length lists
olympic_data_list={'HostCity':['London','Beijing','Athens','Sydney','Atlanta'],
                  'Year':[2012,2008,2004,2000,1996],
                  'No. of participating Countries':[205,204,201,200,197]}

In [50]:
df=pd.DataFrame(olympic_data_list)

In [51]:
df

  HostCity  Year  No. of participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [53]:
#Creating a dataframe from dict of dicts
df1={'London':{2012:205},'Beijing':{2008:204}}

In [54]:
df1=pd.DataFrame(df1)

In [55]:
df1

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [56]:
#viewing dataframes
df.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [57]:
df.describe

<bound method NDFrame.describe of   HostCity  Year  No. of participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [63]:
#Creating dataframe from dict of series
#lets start by creating some series
Oly1=pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
Oly2=pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],index=[2012,2008,2004,2000,1996])
#They need to have the same index values

In [64]:
#Dtaframe from the series. Create a dict with the series as values
Dframe={'No. of Countries Participating':Oly1,'Host Cities':Oly2}

In [65]:
df3=pd.DataFrame(Dframe)

In [66]:
df3

      No. of Countries Participating Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [70]:
#creating Dataframe from ndarray
#Create the ndarrays then create a dict with keys(column names) and the ndarrays as values
np_array=np.array([2012,2008,2004,2006])
np_array2=np.array(['Masila','David','Mwendwa','Mailu'])
dict_ndarray={'year':np_array,'Names':np_array2}

In [71]:
df4=pd.DataFrame(dict_ndarray)

In [72]:
df4

   year    Names
0  2012   Masila
1  2008    David
2  2004  Mwendwa
3  2006    Mailu

In [73]:
df4.describe

<bound method NDFrame.describe of    year    Names
0  2012   Masila
1  2008    David
2  2004  Mwendwa
3  2006    Mailu>

In [74]:
df4.Names

0     Masila
1      David
2    Mwendwa
3      Mailu
Name: Names, dtype: object

### Viewing and Selecting data in pandas